app/controllers/school_district_invites_controller.rb

INSERT INTO "school_district_invites" ("email", "school_district_id", "sender_id", "recipient_id", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @invite = SchoolDistrictInvite.new(sdi_params)
    @invite.sender_id = current_user.id

    if @invite.save