app/controllers/school_districts_controller.rb

  def show
    @school_district = SchoolDistrict.find(params[:id])
---
SELECT  "school_districts".* FROM "school_districts" WHERE "school_districts"."id" = $1 LIMIT 1  [["id", 1]]